/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_bzero.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tmurase <tmurase@student.42tokyo.jp>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/06/23 19:06:24 by mitchiwaki        #+#    #+#             */
/*   Updated: 2021/03/31 08:27:08 by mitchiwak        ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	ft_bzero(void *str, size_t n)
{
	char	*tmp;

	tmp = str;
	while (n-- > 0)
		*tmp++ = 0;
}

/*
** 【概要】
** 	nバイト分、str配列の先頭から0を埋めていく関数。
** 【処理】
** 	省略
*/
