/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstsize.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tmurase <tmurase@student.42tokyo.jp>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/07/04 13:15:55 by tmurase           #+#    #+#             */
/*   Updated: 2020/07/08 01:26:12 by tmurase          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_lstsize(t_list *lst)
{
	int	l_size;

	l_size = 0;
	while (lst != NULL)
	{
		lst = lst->next;
		l_size++;
	}
	return (l_size);
}

/*
** 【概要】
** 	引数の連結リストのノードの数を確認する関数。
*/
